bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>OTG_FS_GLPMCFG</name>
               <displayName>OTG_FS_GLPMCFG</displayName>
               <description>OTG core LPM configuration           register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>LPMEN</name>
                     <description>LPM support enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMACK</name>
                     <description>LPM token acknowledge               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BESL</name>
                     <description>Best effort service               latency</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>REMWAKE</name>
                     <description>bRemoteWake value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>L1SSEN</name>
                     <description>L1 Shallow Sleep enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BESLTHRS</name>
                     <description>BESL threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>L1DSEN</name>
                     <description>L1 deep sleep enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRST</name>
                     <description>LPM response</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLPSTS</name>
                     <description>Port sleep status</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>L1RSMOK</name>
                     <description>Sleep State Resume OK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LPMCHIDX</name>
                     <description>LPM Channel Index</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRCNT</name>
                     <description>LPM retry count</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNDLPM</name>
                     <description>Send LPM transaction</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRCNTSTS</name>
                     <description>LPM retry count status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ENBESL</name>
                     <description>Enable best effort service               latency</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>OTG_HS_GLOBAL</name>
         <description>USB on the go high speed</description>
         <groupName>USB_OTG_HS</groupName>
         <baseAddress>0x40040000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>OTG_HS_GOTGCTL</name>
               <displayName>OTG_HS_GOTGCTL</displayName>
               <description>OTG_HS control and status           register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>SRQSCS</name>
                     <description>Session request success</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRQ</name>
                     <description>Session request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HNGSCS</name>
                     <description>Host negotiation success</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HNPRQ</name>
                     <description>HNP request</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSHNPEN</name>
                     <description>Host set HNP enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DHNPEN</name>
                     <description>Device HNP enabled</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CIDSTS</name>
                     <description>Connector ID status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DBCT</name>
                     <description>Long/short debounce time</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ASVLD</name>
                     <description>A-session valid</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BSVLD</name>
                     <description>B-session valid</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EHEN</name>
                     <description>Embedded host enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_GOTGINT</name>
               <displayName>OTG_HS_GOTGINT</displayName>
               <description>OTG_HS interrupt register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>SEDET</name>
                     <description>Session end detected</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRSSCHG</name>
                     <description>Session request success status               change</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HNSSCHG</name>
                     <description>Host negotiation success status               change</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HNGDET</name>
                     <description>Host negotiation detected</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADTOCHG</name>
                     <description>A-device timeout change</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBCDNE</name>
                     <description>Debounce done</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDCHNG</name>
                     <description>ID input pin changed</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_GAHBCFG</name>
               <displayName>OTG_HS_GAHBCFG</displayName>
               <description>OTG_HS AHB configuration           register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>GINT</name>
                     <description>Global interrupt mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HBSTLEN</name>
                     <description>Burst length/type</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFELVL</name>
                     <description>TxFIFO empty level</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTXFELVL</name>
                     <description>Periodic TxFIFO empty               level</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_GUSBCFG</name>
               <displayName>OTG_HS_GUSBCFG</displayName>
               <description>OTG_HS USB configuration           register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000A00</resetValue>
               <fields>
                  <field>
                     <name>TOCAL</name>
                     <description>FS timeout calibration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PHYSEL</name>
                     <description>USB 2.0 high-speed ULPI PHY or USB 1.1               full-speed serial transceiver select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SRPCAP</name>
                     <description>SRP-capable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HNPCAP</name>
                     <description>HNP-capable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TRDT</name>
                     <description>USB turnaround time</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PHYLPCS</name>
                     <description>PHY Low-power clock select</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ULPIFSLS</name>
                     <description>ULPI FS/LS select</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ULPIAR</name>
                     <description>ULPI Auto-resume</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ULPICSM</name>
                     <description>ULPI Clock SuspendM</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ULPIEVBUSD</name>
                     <description>ULPI External VBUS Drive</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ULPIEVBUSI</name>
                     <description>ULPI external VBUS               indicator</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TSDPS</name>
                     <description>TermSel DLine pulsing               selection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PCCI</name>
                     <description>Indicator complement</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PTCI</name>
                     <description>Indicator pass through</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ULPIIPD</name>
                     <description>ULPI interface protect               disable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FHMOD</name>
                     <description>Forced host mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FDMOD</name>
                     <description>Forced peripheral mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_GRSTCTL</name>
               <displayName>OTG_HS_GRSTCTL</displayName>
               <description>OTG_HS reset register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x20000000</resetValue>
               <fields>
                  <field>
                     <name>CSRST</name>
                     <description>Core soft reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSRST</name>
                     <description>HCLK soft reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FCRST</name>
                     <description>Host frame counter reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RXFFLSH</name>
                     <description>RxFIFO flush</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFFLSH</name>
                     <description>TxFIFO flush</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFNUM</name>
                     <description>TxFIFO number</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AHBIDL</name>
                     <description>AHB master idle</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DMAREQ</name>
                     <description>DMA request signal enabled for USB OTG               HS</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
