bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>MDIOS</name>
         <description>Management data input/output slave</description>
         <groupName>MDIOS</groupName>
         <baseAddress>0x40017800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MDIOS</name>
            <description>MDIO slave global interrupt</description>
            <value>109</value>
         </interrupt>
         <registers>
            <register>
               <name>MDIOS_CR</name>
               <displayName>MDIOS_CR</displayName>
               <description>MDIOS configuration register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Peripheral enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRIE</name>
                     <description>Register write interrupt               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDIE</name>
                     <description>Register Read Interrupt               Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DPC</name>
                     <description>Disable Preamble Check</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORT_ADDRESS</name>
                     <description>Slaves's address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_WRFR</name>
               <displayName>MDIOS_WRFR</displayName>
               <description>MDIOS write flag register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WRF</name>
                     <description>Write flags for MDIO registers 0 to               31</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_CWRFR</name>
               <displayName>MDIOS_CWRFR</displayName>
               <description>MDIOS clear write flag           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CWRF</name>
                     <description>Clear the write flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_RDFR</name>
               <displayName>MDIOS_RDFR</displayName>
               <description>MDIOS read flag register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDF</name>
                     <description>Read flags for MDIO registers 0 to               31</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_CRDFR</name>
               <displayName>MDIOS_CRDFR</displayName>
               <description>MDIOS clear read flag register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRDF</name>
                     <description>Clear the read flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_SR</name>
               <displayName>MDIOS_SR</displayName>
               <description>MDIOS status register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PERF</name>
                     <description>Preamble error flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERF</name>
                     <description>Start error flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TERF</name>
                     <description>Turnaround error flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_CLRFR</name>
               <displayName>MDIOS_CLRFR</displayName>
               <description>MDIOS clear flag register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CPERF</name>
                     <description>Clear the preamble error               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSERF</name>
                     <description>Clear the start error flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTERF</name>
                     <description>Clear the turnaround error               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR0</name>
               <displayName>MDIOS_DINR0</displayName>
               <description>MDIOS input data register 0</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN0</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR1</name>
               <displayName>MDIOS_DINR1</displayName>
               <description>MDIOS input data register 1</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN1</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR2</name>
               <displayName>MDIOS_DINR2</displayName>
               <description>MDIOS input data register 2</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN2</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR3</name>
               <displayName>MDIOS_DINR3</displayName>
               <description>MDIOS input data register 3</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN3</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR4</name>
               <displayName>MDIOS_DINR4</displayName>
               <description>MDIOS input data register 4</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN4</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR5</name>
               <displayName>MDIOS_DINR5</displayName>
               <description>MDIOS input data register 5</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN5</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR6</name>
               <displayName>MDIOS_DINR6</displayName>
               <description>MDIOS input data register 6</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN6</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR7</name>
               <displayName>MDIOS_DINR7</displayName>
               <description>MDIOS input data register 7</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN7</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR8</name>
               <displayName>MDIOS_DINR8</displayName>
               <description>MDIOS input data register 8</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN8</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR9</name>
               <displayName>MDIOS_DINR9</displayName>
               <description>MDIOS input data register 9</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN9</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR10</name>
               <displayName>MDIOS_DINR10</displayName>
               <description>MDIOS input data register 10</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN10</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR11</name>
               <displayName>MDIOS_DINR11</displayName>
               <description>MDIOS input data register 11</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN11</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR12</name>
               <displayName>MDIOS_DINR12</displayName>
               <description>MDIOS input data register 12</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN12</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR13</name>
               <displayName>MDIOS_DINR13</displayName>
               <description>MDIOS input data register 13</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN13</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR14</name>
               <displayName>MDIOS_DINR14</displayName>
               <description>MDIOS input data register 14</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN14</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR15</name>
               <displayName>MDIOS_DINR15</displayName>
               <description>MDIOS input data register 15</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN15</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR16</name>
               <displayName>MDIOS_DINR16</displayName>
               <description>MDIOS input data register 16</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN16</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR17</name>
               <displayName>MDIOS_DINR17</displayName>
               <description>MDIOS input data register 17</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN17</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR18</name>
               <displayName>MDIOS_DINR18</displayName>
               <description>MDIOS input data register 18</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN18</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR19</name>
               <displayName>MDIOS_DINR19</displayName>
               <description>MDIOS input data register 19</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN19</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MDIOS_DINR20</name>
               <displayName>MDIOS_DINR20</displayName>
               <description>MDIOS input data register 20</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIN20</name>
                     <description>Input data received from MDIO Master               during write frames</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
