bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>DFSDM_AWSCD5R</name>
               <displayName>DFSDM_AWSCD5R</displayName>
               <description>DFSDM analog watchdog and short-circuit           detector register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCDT</name>
                     <description>short-circuit detector threshold for               channel 5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BKSCD</name>
                     <description>Break signal assignment for               short-circuit detector on channel 5</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWFOSR</name>
                     <description>Analog watchdog filter oversampling               ratio (decimation rate) on channel 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AWFORD</name>
                     <description>Analog watchdog Sinc filter order on               channel 5</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_AWSCD6R</name>
               <displayName>DFSDM_AWSCD6R</displayName>
               <description>DFSDM analog watchdog and short-circuit           detector register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCDT</name>
                     <description>short-circuit detector threshold for               channel 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BKSCD</name>
                     <description>Break signal assignment for               short-circuit detector on channel 6</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWFOSR</name>
                     <description>Analog watchdog filter oversampling               ratio (decimation rate) on channel 6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AWFORD</name>
                     <description>Analog watchdog Sinc filter order on               channel 6</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_AWSCD7R</name>
               <displayName>DFSDM_AWSCD7R</displayName>
               <description>DFSDM analog watchdog and short-circuit           detector register</description>
               <addressOffset>0x5C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCDT</name>
                     <description>short-circuit detector threshold for               channel 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BKSCD</name>
                     <description>Break signal assignment for               short-circuit detector on channel 7</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AWFOSR</name>
                     <description>Analog watchdog filter oversampling               ratio (decimation rate) on channel 7</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AWFORD</name>
                     <description>Analog watchdog Sinc filter order on               channel 7</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHWDAT0R</name>
               <displayName>DFSDM_CHWDAT0R</displayName>
               <description>DFSDM channel watchdog filter data           register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>Input channel y watchdog               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHWDAT1R</name>
               <displayName>DFSDM_CHWDAT1R</displayName>
               <description>DFSDM channel watchdog filter data           register</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>Input channel y watchdog               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHWDAT2R</name>
               <displayName>DFSDM_CHWDAT2R</displayName>
               <description>DFSDM channel watchdog filter data           register</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>Input channel y watchdog               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHWDAT3R</name>
               <displayName>DFSDM_CHWDAT3R</displayName>
               <description>DFSDM channel watchdog filter data           register</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>Input channel y watchdog               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHWDAT4R</name>
               <displayName>DFSDM_CHWDAT4R</displayName>
               <description>DFSDM channel watchdog filter data           register</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>Input channel y watchdog               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHWDAT5R</name>
               <displayName>DFSDM_CHWDAT5R</displayName>
               <description>DFSDM channel watchdog filter data           register</description>
               <addressOffset>0x74</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>Input channel y watchdog               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHWDAT6R</name>
               <displayName>DFSDM_CHWDAT6R</displayName>
               <description>DFSDM channel watchdog filter data           register</description>
               <addressOffset>0x78</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>Input channel y watchdog               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHWDAT7R</name>
               <displayName>DFSDM_CHWDAT7R</displayName>
               <description>DFSDM channel watchdog filter data           register</description>
               <addressOffset>0x7C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA</name>
                     <description>Input channel y watchdog               data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHDATIN0R</name>
               <displayName>DFSDM_CHDATIN0R</displayName>
               <description>DFSDM channel data input           register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDAT0</name>
                     <description>Input data for channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INDAT1</name>
                     <description>Input data for channel 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHDATIN1R</name>
               <displayName>DFSDM_CHDATIN1R</displayName>
               <description>DFSDM channel data input           register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDAT0</name>
                     <description>Input data for channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INDAT1</name>
                     <description>Input data for channel 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHDATIN2R</name>
               <displayName>DFSDM_CHDATIN2R</displayName>
               <description>DFSDM channel data input           register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDAT0</name>
                     <description>Input data for channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INDAT1</name>
                     <description>Input data for channel 3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHDATIN3R</name>
               <displayName>DFSDM_CHDATIN3R</displayName>
               <description>DFSDM channel data input           register</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDAT0</name>
                     <description>Input data for channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INDAT1</name>
                     <description>Input data for channel 4</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHDATIN4R</name>
               <displayName>DFSDM_CHDATIN4R</displayName>
               <description>DFSDM channel data input           register</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDAT0</name>
                     <description>Input data for channel 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INDAT1</name>
                     <description>Input data for channel 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHDATIN5R</name>
               <displayName>DFSDM_CHDATIN5R</displayName>
               <description>DFSDM channel data input           register</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDAT0</name>
                     <description>Input data for channel 5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INDAT1</name>
                     <description>Input data for channel 6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHDATIN6R</name>
               <displayName>DFSDM_CHDATIN6R</displayName>
               <description>DFSDM channel data input           register</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDAT0</name>
                     <description>Input data for channel 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INDAT1</name>
                     <description>Input data for channel 7</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM_CHDATIN7R</name>
               <displayName>DFSDM_CHDATIN7R</displayName>
               <description>DFSDM channel data input           register</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDAT0</name>
                     <description>Input data for channel 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INDAT1</name>
                     <description>Input data for channel 8</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_CR1</name>
               <displayName>DFSDM0_CR1</displayName>
               <description>DFSDM control register 1</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DFEN</name>
                     <description>DFSDM enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSWSTART</name>
                     <description>Start a conversion of the injected group               of channels</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSYNC</name>
                     <description>Launch an injected conversion               synchronously with the DFSDM0 JSWSTART               trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JSCAN</name>
                     <description>Scanning conversion mode for injected               conversions</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JDMAEN</name>
                     <description>DMA channel enabled to read data for the               injected channel group</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>JEXTSEL</name>
                     <description>Trigger signal selection for launching               injected conversions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JEXTEN</name>
                     <description>Trigger enable and trigger edge               selection for injected conversions</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RSWSTART</name>
                     <description>Software start of a conversion on the               regular channel</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCONT</name>
                     <description>Continuous mode selection for regular               conversions</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSYNC</name>
                     <description>Launch regular conversion synchronously               with DFSDM0</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDMAEN</name>
                     <description>DMA channel enabled to read data for the               regular conversion</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCH</name>
                     <description>Regular channel selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FAST</name>
                     <description>Fast conversion mode selection for               regular conversions</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWFSEL</name>
                     <description>Analog watchdog fast mode               select</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
