bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>DFSDM1_AWSR</name>
               <displayName>DFSDM1_AWSR</displayName>
               <description>DFSDM analog watchdog status           register</description>
               <addressOffset>0x144</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWLTF</name>
                     <description>Analog watchdog low threshold               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AWHTF</name>
                     <description>Analog watchdog high threshold               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_AWSR</name>
               <displayName>DFSDM2_AWSR</displayName>
               <description>DFSDM analog watchdog status           register</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWLTF</name>
                     <description>Analog watchdog low threshold               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AWHTF</name>
                     <description>Analog watchdog high threshold               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_AWSR</name>
               <displayName>DFSDM3_AWSR</displayName>
               <description>DFSDM analog watchdog status           register</description>
               <addressOffset>0x14C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWLTF</name>
                     <description>Analog watchdog low threshold               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AWHTF</name>
                     <description>Analog watchdog high threshold               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_AWCFR</name>
               <displayName>DFSDM0_AWCFR</displayName>
               <description>DFSDM analog watchdog clear flag           register</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRAWLTF</name>
                     <description>Clear the analog watchdog low threshold               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLRAWHTF</name>
                     <description>Clear the analog watchdog high threshold               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_AWCFR</name>
               <displayName>DFSDM1_AWCFR</displayName>
               <description>DFSDM analog watchdog clear flag           register</description>
               <addressOffset>0x154</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRAWLTF</name>
                     <description>Clear the analog watchdog low threshold               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLRAWHTF</name>
                     <description>Clear the analog watchdog high threshold               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_AWCFR</name>
               <displayName>DFSDM2_AWCFR</displayName>
               <description>DFSDM analog watchdog clear flag           register</description>
               <addressOffset>0x158</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRAWLTF</name>
                     <description>Clear the analog watchdog low threshold               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLRAWHTF</name>
                     <description>Clear the analog watchdog high threshold               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_AWCFR</name>
               <displayName>DFSDM3_AWCFR</displayName>
               <description>DFSDM analog watchdog clear flag           register</description>
               <addressOffset>0x15C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRAWLTF</name>
                     <description>Clear the analog watchdog low threshold               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CLRAWHTF</name>
                     <description>Clear the analog watchdog high threshold               flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_EXMAX</name>
               <displayName>DFSDM0_EXMAX</displayName>
               <description>DFSDM Extremes detector maximum           register</description>
               <addressOffset>0x160</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXMAXCH</name>
                     <description>Extremes detector maximum data               channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXMAX</name>
                     <description>Extremes detector maximum               value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_EXMAX</name>
               <displayName>DFSDM1_EXMAX</displayName>
               <description>DFSDM Extremes detector maximum           register</description>
               <addressOffset>0x164</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXMAXCH</name>
                     <description>Extremes detector maximum data               channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXMAX</name>
                     <description>Extremes detector maximum               value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_EXMAX</name>
               <displayName>DFSDM2_EXMAX</displayName>
               <description>DFSDM Extremes detector maximum           register</description>
               <addressOffset>0x168</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXMAXCH</name>
                     <description>Extremes detector maximum data               channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXMAX</name>
                     <description>Extremes detector maximum               value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_EXMAX</name>
               <displayName>DFSDM3_EXMAX</displayName>
               <description>DFSDM Extremes detector maximum           register</description>
               <addressOffset>0x16C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXMAXCH</name>
                     <description>Extremes detector maximum data               channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXMAX</name>
                     <description>Extremes detector maximum               value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_EXMIN</name>
               <displayName>DFSDM0_EXMIN</displayName>
               <description>DFSDM Extremes detector minimum           register</description>
               <addressOffset>0x170</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXMINCH</name>
                     <description>Extremes detector minimum data               channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXMIN</name>
                     <description>Extremes detector minimum               value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_EXMIN</name>
               <displayName>DFSDM1_EXMIN</displayName>
               <description>DFSDM Extremes detector minimum           register</description>
               <addressOffset>0x174</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXMINCH</name>
                     <description>Extremes detector minimum data               channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXMIN</name>
                     <description>Extremes detector minimum               value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_EXMIN</name>
               <displayName>DFSDM2_EXMIN</displayName>
               <description>DFSDM Extremes detector minimum           register</description>
               <addressOffset>0x178</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXMINCH</name>
                     <description>Extremes detector minimum data               channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXMIN</name>
                     <description>Extremes detector minimum               value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_EXMIN</name>
               <displayName>DFSDM3_EXMIN</displayName>
               <description>DFSDM Extremes detector minimum           register</description>
               <addressOffset>0x17C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXMINCH</name>
                     <description>Extremes detector minimum data               channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>EXMIN</name>
                     <description>Extremes detector minimum               value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM0_CNVTIMR</name>
               <displayName>DFSDM0_CNVTIMR</displayName>
               <description>DFSDM conversion timer           register</description>
               <addressOffset>0x180</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNVCNT</name>
                     <description>28-bit timer counting conversion               time</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM1_CNVTIMR</name>
               <displayName>DFSDM1_CNVTIMR</displayName>
               <description>DFSDM conversion timer           register</description>
               <addressOffset>0x184</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNVCNT</name>
                     <description>28-bit timer counting conversion               time</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM2_CNVTIMR</name>
               <displayName>DFSDM2_CNVTIMR</displayName>
               <description>DFSDM conversion timer           register</description>
               <addressOffset>0x188</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNVCNT</name>
                     <description>28-bit timer counting conversion               time</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFSDM3_CNVTIMR</name>
               <displayName>DFSDM3_CNVTIMR</displayName>
               <description>DFSDM conversion timer           register</description>
               <addressOffset>0x18C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNVCNT</name>
                     <description>28-bit timer counting conversion               time</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
