bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>QMEM0_4</name>
               <displayName>QMEM0_4</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_5</name>
               <displayName>QMEM0_5</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_6</name>
               <displayName>QMEM0_6</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_7</name>
               <displayName>QMEM0_7</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_8</name>
               <displayName>QMEM0_8</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x70</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_9</name>
               <displayName>QMEM0_9</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x74</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_10</name>
               <displayName>QMEM0_10</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x78</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_11</name>
               <displayName>QMEM0_11</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x7C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_12</name>
               <displayName>QMEM0_12</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_13</name>
               <displayName>QMEM0_13</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_14</name>
               <displayName>QMEM0_14</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM0_15</name>
               <displayName>QMEM0_15</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_0</name>
               <displayName>QMEM1_0</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x90</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_1</name>
               <displayName>QMEM1_1</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x94</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_2</name>
               <displayName>QMEM1_2</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x98</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_3</name>
               <displayName>QMEM1_3</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0x9C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_4</name>
               <displayName>QMEM1_4</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_5</name>
               <displayName>QMEM1_5</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_6</name>
               <displayName>QMEM1_6</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xA8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_7</name>
               <displayName>QMEM1_7</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xAC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_8</name>
               <displayName>QMEM1_8</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xB0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_9</name>
               <displayName>QMEM1_9</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xB4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_10</name>
               <displayName>QMEM1_10</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xB8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_11</name>
               <displayName>QMEM1_11</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xBC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_12</name>
               <displayName>QMEM1_12</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xC0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_13</name>
               <displayName>QMEM1_13</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xC4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_14</name>
               <displayName>QMEM1_14</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xC8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM1_15</name>
               <displayName>QMEM1_15</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xCC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_0</name>
               <displayName>QMEM2_0</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xD0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_1</name>
               <displayName>QMEM2_1</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xD4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_2</name>
               <displayName>QMEM2_2</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xD8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_3</name>
               <displayName>QMEM2_3</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xDC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_4</name>
               <displayName>QMEM2_4</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xE0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_5</name>
               <displayName>QMEM2_5</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xE4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QMEM2_6</name>
               <displayName>QMEM2_6</displayName>
               <description>JPEG quantization tables</description>
               <addressOffset>0xE8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QMem_RAM</name>
                     <description>QMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
