bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>DHTMEM77</name>
               <displayName>DHTMEM77</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x490</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM78</name>
               <displayName>DHTMEM78</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x494</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM79</name>
               <displayName>DHTMEM79</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x498</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM80</name>
               <displayName>DHTMEM80</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x49C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM81</name>
               <displayName>DHTMEM81</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4A0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM82</name>
               <displayName>DHTMEM82</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4A4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM83</name>
               <displayName>DHTMEM83</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4A8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM84</name>
               <displayName>DHTMEM84</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4AC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM85</name>
               <displayName>DHTMEM85</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4B0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM86</name>
               <displayName>DHTMEM86</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4B4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM87</name>
               <displayName>DHTMEM87</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4B8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM88</name>
               <displayName>DHTMEM88</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4BC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM89</name>
               <displayName>DHTMEM89</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4C0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM90</name>
               <displayName>DHTMEM90</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4C4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM91</name>
               <displayName>DHTMEM91</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4C8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM92</name>
               <displayName>DHTMEM92</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4CC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM93</name>
               <displayName>DHTMEM93</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4D0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM94</name>
               <displayName>DHTMEM94</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4D4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM95</name>
               <displayName>DHTMEM95</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4D8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM96</name>
               <displayName>DHTMEM96</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4DC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM97</name>
               <displayName>DHTMEM97</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4E0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM98</name>
               <displayName>DHTMEM98</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4E4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM99</name>
               <displayName>DHTMEM99</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4E8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM100</name>
               <displayName>DHTMEM100</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4EC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM101</name>
               <displayName>DHTMEM101</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4F0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM102</name>
               <displayName>DHTMEM102</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4F4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DHTMEM103</name>
               <displayName>DHTMEM103</displayName>
               <description>JPEG DHTMem tables</description>
               <addressOffset>0x4F8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_0</name>
               <displayName>HUFFENC_AC0_0</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x500</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_1</name>
               <displayName>HUFFENC_AC0_1</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x504</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_2</name>
               <displayName>HUFFENC_AC0_2</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x508</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_3</name>
               <displayName>HUFFENC_AC0_3</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x50C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_4</name>
               <displayName>HUFFENC_AC0_4</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x510</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_5</name>
               <displayName>HUFFENC_AC0_5</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x514</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_6</name>
               <displayName>HUFFENC_AC0_6</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x518</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC0_7</name>
               <displayName>HUFFENC_AC0_7</displayName>
               <description>JPEG encoder, AC Huffman table           0</description>
               <addressOffset>0x51C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
