bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>HUFFENC_AC1_85</name>
               <displayName>HUFFENC_AC1_85</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x7B4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_86</name>
               <displayName>HUFFENC_AC1_86</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x7B8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_AC1_87</name>
               <displayName>HUFFENC_AC1_87</displayName>
               <description>JPEG encoder, AC Huffman table           1</description>
               <addressOffset>0x7BC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC0_0</name>
               <displayName>HUFFENC_DC0_0</displayName>
               <description>JPEG encoder, DC Huffman table           0</description>
               <addressOffset>0x7C0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC0_1</name>
               <displayName>HUFFENC_DC0_1</displayName>
               <description>JPEG encoder, DC Huffman table           0</description>
               <addressOffset>0x7C4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC0_2</name>
               <displayName>HUFFENC_DC0_2</displayName>
               <description>JPEG encoder, DC Huffman table           0</description>
               <addressOffset>0x7C8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC0_3</name>
               <displayName>HUFFENC_DC0_3</displayName>
               <description>JPEG encoder, DC Huffman table           0</description>
               <addressOffset>0x7CC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC0_4</name>
               <displayName>HUFFENC_DC0_4</displayName>
               <description>JPEG encoder, DC Huffman table           0</description>
               <addressOffset>0x7D0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC0_5</name>
               <displayName>HUFFENC_DC0_5</displayName>
               <description>JPEG encoder, DC Huffman table           0</description>
               <addressOffset>0x7D4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC0_6</name>
               <displayName>HUFFENC_DC0_6</displayName>
               <description>JPEG encoder, DC Huffman table           0</description>
               <addressOffset>0x7D8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC0_7</name>
               <displayName>HUFFENC_DC0_7</displayName>
               <description>JPEG encoder, DC Huffman table           0</description>
               <addressOffset>0x7DC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC1_0</name>
               <displayName>HUFFENC_DC1_0</displayName>
               <description>JPEG encoder, DC Huffman table           1</description>
               <addressOffset>0x7E0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC1_1</name>
               <displayName>HUFFENC_DC1_1</displayName>
               <description>JPEG encoder, DC Huffman table           1</description>
               <addressOffset>0x7E4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC1_2</name>
               <displayName>HUFFENC_DC1_2</displayName>
               <description>JPEG encoder, DC Huffman table           1</description>
               <addressOffset>0x7E8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC1_3</name>
               <displayName>HUFFENC_DC1_3</displayName>
               <description>JPEG encoder, DC Huffman table           1</description>
               <addressOffset>0x7EC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC1_4</name>
               <displayName>HUFFENC_DC1_4</displayName>
               <description>JPEG encoder, DC Huffman table           1</description>
               <addressOffset>0x7F0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC1_5</name>
               <displayName>HUFFENC_DC1_5</displayName>
               <description>JPEG encoder, DC Huffman table           1</description>
               <addressOffset>0x7F4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC1_6</name>
               <displayName>HUFFENC_DC1_6</displayName>
               <description>JPEG encoder, DC Huffman table           1</description>
               <addressOffset>0x7F8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HUFFENC_DC1_7</name>
               <displayName>HUFFENC_DC1_7</displayName>
               <description>JPEG encoder, DC Huffman table           1</description>
               <addressOffset>0x7FC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DHTMem_RAM</name>
                     <description>DHTMem RAM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
