bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>OTG_FS_DOEPCTL3</name>
               <displayName>OTG_FS_DOEPCTL3</displayName>
               <description>device endpoint-3 control           register</description>
               <addressOffset>0x360</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EPENA</name>
                     <description>EPENA</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>EPDIS</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>SODDFRM</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>SD0PID/SEVNFRM</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>SNAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>CNAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>Stall</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>SNPM</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>EPTYP</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAKSTS</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>EONUM/DPID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USBAEP</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MPSIZ</name>
                     <description>MPSIZ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPINT0</name>
               <displayName>OTG_FS_DIEPINT0</displayName>
               <description>device endpoint-x interrupt           register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>TXFE</name>
                     <description>TXFE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>INEPNE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>ITTXFE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>TOC</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>EPDISD</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>XFRC</name>
                     <description>XFRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPINT1</name>
               <displayName>OTG_FS_DIEPINT1</displayName>
               <description>device endpoint-1 interrupt           register</description>
               <addressOffset>0x128</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>TXFE</name>
                     <description>TXFE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>INEPNE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>ITTXFE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>TOC</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>EPDISD</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>XFRC</name>
                     <description>XFRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPINT2</name>
               <displayName>OTG_FS_DIEPINT2</displayName>
               <description>device endpoint-2 interrupt           register</description>
               <addressOffset>0x148</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>TXFE</name>
                     <description>TXFE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>INEPNE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>ITTXFE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>TOC</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>EPDISD</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>XFRC</name>
                     <description>XFRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPINT3</name>
               <displayName>OTG_FS_DIEPINT3</displayName>
               <description>device endpoint-3 interrupt           register</description>
               <addressOffset>0x168</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>TXFE</name>
                     <description>TXFE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INEPNE</name>
                     <description>INEPNE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ITTXFE</name>
                     <description>ITTXFE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TOC</name>
                     <description>TOC</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>EPDISD</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>XFRC</name>
                     <description>XFRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DOEPINT0</name>
               <displayName>OTG_FS_DOEPINT0</displayName>
               <description>device endpoint-0 interrupt           register</description>
               <addressOffset>0x308</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>B2BSTUP</name>
                     <description>B2BSTUP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OTEPDIS</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>STUP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>EPDISD</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRC</name>
                     <description>XFRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DOEPINT1</name>
               <displayName>OTG_FS_DOEPINT1</displayName>
               <description>device endpoint-1 interrupt           register</description>
               <addressOffset>0x328</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>B2BSTUP</name>
                     <description>B2BSTUP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OTEPDIS</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>STUP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>EPDISD</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRC</name>
                     <description>XFRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DOEPINT2</name>
               <displayName>OTG_FS_DOEPINT2</displayName>
               <description>device endpoint-2 interrupt           register</description>
               <addressOffset>0x348</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>B2BSTUP</name>
                     <description>B2BSTUP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OTEPDIS</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>STUP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>EPDISD</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRC</name>
                     <description>XFRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DOEPINT3</name>
               <displayName>OTG_FS_DOEPINT3</displayName>
               <description>device endpoint-3 interrupt           register</description>
               <addressOffset>0x368</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000080</resetValue>
               <fields>
                  <field>
                     <name>B2BSTUP</name>
                     <description>B2BSTUP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTEPDIS</name>
                     <description>OTEPDIS</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUP</name>
                     <description>STUP</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPDISD</name>
                     <description>EPDISD</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRC</name>
                     <description>XFRC</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTSIZ0</name>
               <displayName>OTG_FS_DIEPTSIZ0</displayName>
               <description>device endpoint-0 transfer size           register</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DOEPTSIZ0</name>
               <displayName>OTG_FS_DOEPTSIZ0</displayName>
               <description>device OUT endpoint-0 transfer size           register</description>
               <addressOffset>0x310</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STUPCNT</name>
                     <description>SETUP packet count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTSIZ1</name>
               <displayName>OTG_FS_DIEPTSIZ1</displayName>
               <description>device endpoint-1 transfer size           register</description>
               <addressOffset>0x130</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTSIZ2</name>
               <displayName>OTG_FS_DIEPTSIZ2</displayName>
               <description>device endpoint-2 transfer size           register</description>
               <addressOffset>0x150</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
