bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>OTG_HS_DIEPDMA1</name>
               <displayName>OTG_HS_DIEPDMA1</displayName>
               <description>OTG_HS device endpoint-1 DMA address           register</description>
               <addressOffset>0x114</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA2</name>
               <displayName>OTG_HS_DIEPDMA2</displayName>
               <description>OTG_HS device endpoint-2 DMA address           register</description>
               <addressOffset>0x134</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA3</name>
               <displayName>OTG_HS_DIEPDMA3</displayName>
               <description>OTG_HS device endpoint-3 DMA address           register</description>
               <addressOffset>0x154</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA4</name>
               <displayName>OTG_HS_DIEPDMA4</displayName>
               <description>OTG_HS device endpoint-4 DMA address           register</description>
               <addressOffset>0x174</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPDMA5</name>
               <displayName>OTG_HS_DIEPDMA5</displayName>
               <description>OTG_HS device endpoint-5 DMA address           register</description>
               <addressOffset>0x194</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DMAADDR</name>
                     <description>DMA address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTXFSTS0</name>
               <displayName>OTG_HS_DTXFSTS0</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x118</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               avail</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTXFSTS1</name>
               <displayName>OTG_HS_DTXFSTS1</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x138</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               avail</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTXFSTS2</name>
               <displayName>OTG_HS_DTXFSTS2</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               avail</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTXFSTS3</name>
               <displayName>OTG_HS_DTXFSTS3</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x178</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               avail</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTXFSTS4</name>
               <displayName>OTG_HS_DTXFSTS4</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x198</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               avail</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DTXFSTS5</name>
               <displayName>OTG_HS_DTXFSTS5</displayName>
               <description>OTG_HS device IN endpoint transmit FIFO           status register</description>
               <addressOffset>0x1B8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>INEPTFSAV</name>
                     <description>IN endpoint TxFIFO space               avail</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTSIZ1</name>
               <displayName>OTG_HS_DIEPTSIZ1</displayName>
               <description>OTG_HS device endpoint transfer size           register</description>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTSIZ2</name>
               <displayName>OTG_HS_DIEPTSIZ2</displayName>
               <description>OTG_HS device endpoint transfer size           register</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTSIZ3</name>
               <displayName>OTG_HS_DIEPTSIZ3</displayName>
               <description>OTG_HS device endpoint transfer size           register</description>
               <addressOffset>0x170</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTSIZ4</name>
               <displayName>OTG_HS_DIEPTSIZ4</displayName>
               <description>OTG_HS device endpoint transfer size           register</description>
               <addressOffset>0x190</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DIEPTSIZ5</name>
               <displayName>OTG_HS_DIEPTSIZ5</displayName>
               <description>OTG_HS device endpoint transfer size           register</description>
               <addressOffset>0x1B0</addressOffset>
               <size>32</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>XFRSIZ</name>
                     <description>Transfer size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
                  <field>
                     <name>PKTCNT</name>
                     <description>Packet count</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>MCNT</name>
                     <description>Multi count</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPCTL0</name>
               <displayName>OTG_HS_DOEPCTL0</displayName>
               <description>OTG_HS device control OUT endpoint 0 control           register</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_HS_DOEPCTL1</name>
               <displayName>OTG_HS_DOEPCTL1</displayName>
               <description>OTG device endpoint-1 control           register</description>
               <addressOffset>0x320</addressOffset>
               <size>32</size>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>MPSIZ</name>
                     <description>Maximum packet size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBAEP</name>
                     <description>USB active endpoint</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EONUM_DPID</name>
                     <description>Even odd frame/Endpoint data               PID</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NAKSTS</name>
                     <description>NAK status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EPTYP</name>
                     <description>Endpoint type</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNPM</name>
                     <description>Snoop mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>Stall</name>
                     <description>STALL handshake</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNAK</name>
                     <description>Clear NAK</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SNAK</name>
                     <description>Set NAK</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SD0PID_SEVNFRM</name>
                     <description>Set DATA0 PID/Set even               frame</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SODDFRM</name>
                     <description>Set odd frame</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EPDIS</name>
                     <description>Endpoint disable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPENA</name>
                     <description>Endpoint enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
