bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F7x9.svd
            <register>
               <name>DSI_WCFGR</name>
               <displayName>DSI_WCFGR</displayName>
               <description>DSI Wrapper Configuration           Register</description>
               <addressOffset>0x400</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VSPOL</name>
                     <description>VSync Polarity</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR</name>
                     <description>Automatic Refresh</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEPOL</name>
                     <description>TE Polarity</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TESRC</name>
                     <description>TE Source</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COLMUX</name>
                     <description>Color Multiplexing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DSIM</name>
                     <description>DSI Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WCR</name>
               <displayName>DSI_WCR</displayName>
               <description>DSI Wrapper Control Register</description>
               <addressOffset>0x404</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DSIEN</name>
                     <description>DSI Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LTDCEN</name>
                     <description>LTDC Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHTDN</name>
                     <description>Shutdown</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COLM</name>
                     <description>Color Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WIER</name>
               <displayName>DSI_WIER</displayName>
               <description>DSI Wrapper Interrupt Enable           Register</description>
               <addressOffset>0x408</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RRIE</name>
                     <description>Regulator Ready Interrupt               Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLUIE</name>
                     <description>PLL Unlock Interrupt               Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLLIE</name>
                     <description>PLL Lock Interrupt Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERIE</name>
                     <description>End of Refresh Interrupt               Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIE</name>
                     <description>Tearing Effect Interrupt               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WISR</name>
               <displayName>DSI_WISR</displayName>
               <description>DSI Wrapper Interrupt &amp; Status           Register</description>
               <addressOffset>0x40C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RRIF</name>
                     <description>Regulator Ready Interrupt               Flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RRS</name>
                     <description>Regulator Ready Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLUIF</name>
                     <description>PLL Unlock Interrupt Flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLLIF</name>
                     <description>PLL Lock Interrupt Flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLLS</name>
                     <description>PLL Lock Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERIF</name>
                     <description>End of Refresh Interrupt               Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEIF</name>
                     <description>Tearing Effect Interrupt               Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WIFCR</name>
               <displayName>DSI_WIFCR</displayName>
               <description>DSI Wrapper Interrupt Flag Clear           Register</description>
               <addressOffset>0x410</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRRIF</name>
                     <description>Clear Regulator Ready Interrupt               Flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPLLUIF</name>
                     <description>Clear PLL Unlock Interrupt               Flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPLLLIF</name>
                     <description>Clear PLL Lock Interrupt               Flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CERIF</name>
                     <description>Clear End of Refresh Interrupt               Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTEIF</name>
                     <description>Clear Tearing Effect Interrupt               Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WPCR1</name>
               <displayName>DSI_WPCR1</displayName>
               <description>DSI Wrapper PHY Configuration Register           1</description>
               <addressOffset>0x418</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TCLKPOSTEN</name>
                     <description>custom time for tCLK-POST               Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TLPXCEN</name>
                     <description>custom time for tLPX for Clock lane               Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THSEXITEN</name>
                     <description>custom time for tHS-EXIT               Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TLPXDEN</name>
                     <description>custom time for tLPX for Data lanes               Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THSZEROEN</name>
                     <description>custom time for tHS-ZERO               Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THSTRAILEN</name>
                     <description>custom time for tHS-TRAIL               Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>THSPREPEN</name>
                     <description>custom time for tHS-PREPARE               Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCLKZEROEN</name>
                     <description>custom time for tCLK-ZERO               Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCLKPREPEN</name>
                     <description>custom time for tCLK-PREPARE               Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDEN</name>
                     <description>Pull-Down Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TDDL</name>
                     <description>Turn Disable Data Lanes</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CDOFFDL</name>
                     <description>Contention Detection OFF on Data               Lanes</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTXSMDL</name>
                     <description>Force in TX Stop Mode the Data               Lanes</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FTXSMCL</name>
                     <description>Force in TX Stop Mode the Clock               Lane</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSIDL1</name>
                     <description>Invert the High-Speed data signal on               Data Lane 1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSIDL0</name>
                     <description>Invert the Hight-Speed data signal on               Data Lane 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSICL</name>
                     <description>Invert Hight-Speed data signal on Clock               Lane</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWDL1</name>
                     <description>Swap Data Lane 1 pins</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWDL0</name>
                     <description>Swap Data Lane 0 pins</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWCL</name>
                     <description>Swap Clock Lane pins</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIX4</name>
                     <description>Unit Interval multiplied by               4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WPCR2</name>
               <displayName>DSI_WPCR2</displayName>
               <description>DSI Wrapper PHY Configuration Register           2</description>
               <addressOffset>0x41C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPRXFT</name>
                     <description>Low-Power RX low-pass Filtering               Tuning</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FLPRXLPM</name>
                     <description>Forces LP Receiver in Low-Power               Mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSTXSRCDL</name>
                     <description>High-Speed Transmission Slew Rate               Control on Data Lanes</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>HSTXSRCCL</name>
                     <description>High-Speed Transmission Slew Rate               Control on Clock Lane</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SDCC</name>
                     <description>SDD Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPSRDL</name>
                     <description>Low-Power transmission Slew Rate               Compensation on Data Lanes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LPSRCL</name>
                     <description>Low-Power transmission Slew Rate               Compensation on Clock Lane</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>HSTXDLL</name>
                     <description>High-Speed Transmission Delay on Data               Lanes</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>HSTXDCL</name>
                     <description>High-Speed Transmission Delay on Clock               Lane</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WPCR3</name>
               <displayName>DSI_WPCR3</displayName>
               <description>DSI Wrapper PHY Configuration Register           3</description>
               <addressOffset>0x420</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>THSTRAIL</name>
                     <description>tHSTRAIL</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>THSPREP</name>
                     <description>tHS-PREPARE</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TCLKZEO</name>
                     <description>tCLK-ZERO</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TCLKPREP</name>
                     <description>tCLK-PREPARE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WPCR4</name>
               <displayName>DSI_WPCR4</displayName>
               <description>DSI_WPCR4</description>
               <addressOffset>0x424</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x3133302A</resetValue>
               <fields>
                  <field>
                     <name>TLPXC</name>
                     <description>tLPXC for Clock lane</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>THSEXIT</name>
                     <description>tHSEXIT</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TLPXD</name>
                     <description>tLPX for Data lanes</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>THSZERO</name>
                     <description>tHS-ZERO</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSI_WPCR5</name>
               <displayName>DSI_WPCR5</displayName>
               <description>DSI Wrapper PHY Configuration Register           5</description>
               <addressOffset>0x428</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>THSZERO</name>
                     <description>tCLK-POST</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
